main:  ; pc = 0x00000000 = 0
  set %r2, $0x00008000 ; SP、スタックとして32KB*8B=256KBを確保  ; pc = 0x00000000 = 0
  addi %r2, %r2, $-64 ; SP -= 64  ; pc = 0x00000004 = 4
  addi %r3, %r2, $64  ; FP = SP + 64, main()のフレームの出来上がり  ; pc = 0x00000008 = 8
  set %r9, $2   ; const int 1  ; pc = 0x0000000C = 12
  set %r5, $35  ; fib_rec(5) を呼びたい  ; pc = 0x00000010 = 16
  jal %r1, fib_rec   ; r1 = 7 * pc_interval  ; pc = 0x00000014 = 20
  jal %r1, finish  ; pc = 0x00000018 = 24
fib_rec:  ; pc = 0x0000001C = 28
  addi %r2, %r2, $-64 ; SP -= 64  ; pc = 0x0000001C = 28
  sw %r2, %r1, $16    ; LR退避  ; pc = 0x00000020 = 32
  sw %r2, %r3, $20    ; FP退避  ; pc = 0x00000024 = 36
  addi %r3, %r2, $64  ; FP = SP + 64  ; pc = 0x00000028 = 40
  sw %r2, %r5, $0     ; 第一引数  ; pc = 0x0000002C = 44
  bge %r9, %r5, fib_rec_bge1   ; if (1 >= x) -> bge1  ; pc = 0x00000030 = 48
  addi %r5, %r5, $-1  ; else { val1 = x - 1;  ; pc = 0x00000034 = 52
  jal %r1, fib_rec   ; fib_rec(val1);  ; pc = 0x00000038 = 56
  sw %r2, %r4, $32    ; a[8] = fib_rec(a);  ; pc = 0x0000003C = 60
  lw %r5, %r2, $0     ; 第一引数読み戻し  ; pc = 0x00000040 = 64
  addi %r5, %r5, $-2  ; val2 = x - 2;  ; pc = 0x00000044 = 68
  jal %r1, fib_rec   ; fib_rec(val2);  ; pc = 0x00000048 = 72
  lw %r10, %r2, $32   ; r10 = a[8]  ; pc = 0x0000004C = 76
  add %r4, %r10, %r4   ; return fib_rec(val1) + fib_rec(val2)!  ; pc = 0x00000050 = 80
fib_rec_ret:  ; pc = 0x00000054 = 84
  lw %r1, %r2, $16    ; 退避したLRの読み戻し  ; pc = 0x00000054 = 84
  lw %r3, %r2, $20    ; 退避したFPの読み戻し  ; pc = 0x00000058 = 88
  addi %r2, %r2, $64 ; SP += 64  ; pc = 0x0000005C = 92
  jalr %r1, %r1, $0   ; 呼び出し元の関数に戻る  ; pc = 0x00000060 = 96
fib_rec_bge1:  ; pc = 0x00000064 = 100
  set %r4, $1   ; if (x == 0 || x == 1) return 1  ; pc = 0x00000064 = 100
  beq %r0, %r0, fib_rec_ret ; go back  ; pc = 0x00000068 = 104
finish:  ; pc = 0x0000006C = 108
  addi %r0, %r0, $0   ; 終了  ; pc = 0x0000006C = 108
  ; pc = 0x00000070 = 112
  ; pc = 0x00000070 = 112
/*  ; pc = 0x00000070 = 112
特殊なレジスタについて  ; pc = 0x00000070 = 112
・r0: ゼロレジスタ  ; pc = 0x00000070 = 112
・r1: リンクレジスタ  ; pc = 0x00000070 = 112
・r2: スタックポインタ  ; pc = 0x00000070 = 112
・r3: フレームポインタ  ; pc = 0x00000070 = 112
・r4: 関数の戻り値  ; pc = 0x00000070 = 112
・r5,r6,r7,r8: 関数引数に渡す用、それぞれa[0]~a[3]に対応  ; pc = 0x00000070 = 112
・r9以降: 自由  ; pc = 0x00000070 = 112
  ; pc = 0x00000070 = 112
スタックフレームについて  ; pc = 0x00000070 = 112
・16byte分のスタックフレーム→配列をa[16]と書くと  ; pc = 0x00000070 = 112
・a[0]~a[3]: 引数  ; pc = 0x00000070 = 112
・a[4]:退避したリンクレジスタ  ; pc = 0x00000070 = 112
・a[5]:呼び出し元関数のFP  ; pc = 0x00000070 = 112
・a[6],a[7]: undefined  ; pc = 0x00000070 = 112
・a[8]~a[11]: ローカル変数  ; pc = 0x00000070 = 112
・a[12]~a[15]: レジスタ退避用  ; pc = 0x00000070 = 112
  ; pc = 0x00000070 = 112
参考  ; pc = 0x00000070 = 112
fib[1]  =  1  = 0x1  ; pc = 0x00000070 = 112
fib[2]  =  1  = 0x1  ; pc = 0x00000070 = 112
fib[3]  =  2  = 0x2  ; pc = 0x00000070 = 112
fib[4]  =  3  = 0x3  ; pc = 0x00000070 = 112
fib[5]  =  5  = 0x5  ; pc = 0x00000070 = 112
fib[6]  =  8  = 0x8  ; pc = 0x00000070 = 112
fib[7]  = 13  = 0xa  ; pc = 0x00000070 = 112
fib[8]  = 21  = 0x15  ; pc = 0x00000070 = 112
fib[9]  = 34  = 0x22  ; pc = 0x00000070 = 112
fib[10] = 55  = 0x37  ; pc = 0x00000070 = 112
fib[11] = 89  = 0x59  ; pc = 0x00000070 = 112
fib[12] = 144 = 0x90  ; pc = 0x00000070 = 112
fib[13] = 233 = 0xe9  ; pc = 0x00000070 = 112
fib[14] = 377 = 0x179  ; pc = 0x00000070 = 112
fib[15] = 610 = 0x262  ; pc = 0x00000070 = 112
fib[16] = 987 = 0x3db  ; pc = 0x00000070 = 112
fib[17] = 1597 = 0x63d  ; pc = 0x00000070 = 112
fib[18] = 2584 = 0xa18  ; pc = 0x00000070 = 112
fib[19] = 4181 = 0x1055  ; pc = 0x00000070 = 112
fib[20] = 6765 = 0x1a6d  ; pc = 0x00000070 = 112
fib[21] = 10946 = 0x2ac2  ; pc = 0x00000070 = 112
fib[22] = 17711 = 0x452f  ; pc = 0x00000070 = 112
fib[23] = 28657 = 0x6ff1  ; pc = 0x00000070 = 112
fib[24] = 46368 = 0xb520  ; pc = 0x00000070 = 112
fib[25] = 75025 = 0x12511  ; pc = 0x00000070 = 112
fib[26] = 121393 = 0x1da31  ; pc = 0x00000070 = 112
fib[27] = 196418 = 0x2ff42  ; pc = 0x00000070 = 112
fib[28] = 317811 = 0x4d973  ; pc = 0x00000070 = 112
fib[29] = 514229 = 0x7d8b5  ; pc = 0x00000070 = 112
fib[30] = 832040 = 0xcb228  ; pc = 0x00000070 = 112
fib[31] = 1346269 = 0x148add  ; pc = 0x00000070 = 112
fib[32] = 2178309 = 0x213d05  ; pc = 0x00000070 = 112
fib[33] = 3524578 = 0x35c7e2  ; pc = 0x00000070 = 112
fib[34] = 5702887 = 0x5704e7  ; pc = 0x00000070 = 112
fib[35] = 9227465 = 0x8cccc9 <- 2秒  ; pc = 0x00000070 = 112
fib[36] = 14930352 = 0xe3d1b0  ; pc = 0x00000070 = 112
fib[37] = 24157817 = 0x1709e79  ; pc = 0x00000070 = 112
fib[38] = 39088169 = 0x2547029 <- 9秒  ; pc = 0x00000070 = 112
*/  ; pc = 0x00000070 = 112
